Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: The following example temporarily rebinds the memory of a UInt64 pointer to Int64, then accesses a property on the signed integer.
ja: 以下の例は、 一時的にUInt64ポインタのメモリをInt64に再束縛します、それから符号付き整数上のあるプロパティにアクセスします。

source: The following example transforms a string to uppercase letters:
ja: 以下の例は、ある文字列を大文字の文字に変換します：

source: The following example uses someBytes, an UnsafeMutableRawBufferPointer instance, to demonstrate the difference between assigning a buffer pointer and using a buffer pointer as the source for another collection’s elements.
ja: 以下の例はsomeBytes、UnsafeMutableRawBufferPointerインスタンスを使って、バッファポインタの割り当することとバッファポインタを別のコレクションの要素のソースとして使うことの間の違いを実演します。

source: The following example uses someBytes, an UnsafeRawBufferPointer instance, to demonstrate the difference between assigning a buffer pointer and using a buffer pointer as the source for another collection’s elements.
ja: 以下の例はsomeBytes、UnsafeRawBufferPointerインスタンスを使って、バッファポインタの割り当することとバッファポインタを別のコレクションの要素のソースとして使うことの間の違いを実演します。

source: The following example uses an enumeration of playing cards ranks, Rank, which ranges from ace (low) to king (high).
ja: 以下の例は、トランプのランクそれらからなるある列挙、Rankを使います、それはace（低）からking（高）までに及びます。

source: The following example uses implicit bridging to pass a pointer to value when calling print(address:as:):
ja: 以下の例は、print(address:as:)を呼び出すとき、暗黙的ブリッジを使ってポインタをvalueへと渡します：

source: The following example uses the drop(while:) method to skip over the positive numbers at the beginning of the numbers array.
ja: 以下の例は、drop(while:)メソッドを使って、正の数をnumbers配列の始まりで省きます。

source: The following example uses the first(where:) method to find the first negative number in an array of integers:
ja: 以下の例は、first(where:)メソッドを使って、整数の配列において最初の負数を見つけます：

source: The following example uses the prefix(while:) method to find the positive numbers at the beginning of the numbers array.
ja: 以下の例は、prefix(while:)メソッドを使って、正の数をnumbers配列の始まりで見つけます。

source: The following example uses the zip(_:_:) function to iterate over an array of strings and a countable range at the same time:
ja: 以下の例はzip(_:_:)関数を使って、同時に文字列からなる配列とある可付番範囲の全体にわたって反復します：

source: The following example uses the C strncmp function to compare the beginning of two Swift strings.
ja: 以下の例は、C strncmp関数を使って２つのSwift文字列を比較します。

source: The following example uses the buffer pointer’s subscript to access and modify the elements of a mutable buffer pointing to the contiguous contents of an array:
ja: 以下の例は、バッファポインタのもつ添え字を使うことで、配列の隣接内容を指している可変バッファの要素にアクセスして修正します。

source: The following example uses the buffer pointer’s subscript to access every other element of the buffer:
ja: 以下の例は、バッファポインタの添え字を使うことで、そのバッファのすべての他の要素にアクセスします：

source: The following example uses the subscript to print the value of a string’s first UTF-16 code unit.
ja: 以下の例は、添え字を使って文字列のもつ最初のUTF-16コード単位の値を出力します。

source: The following example uses the subscript to print the value of a string’s first UTF-8 code unit.
ja: 以下の例は、添え字を使って文字列のもつ最初のUTF-8コード単位の値を出力します。

source: The following example uses this method to multiply two Int8 values that normally overflow when multiplied:
ja: 以下の例は、このメソッドを使って、通常は乗算した時オーバーフローする２つのInt8値を乗算します：

source: The following example uses this method to multiply two UInt8 values that normally overflow when multiplied:
ja: 以下の例は、このメソッドを使って、通常は乗算した時オーバーフローする２つのUInt8値を乗算します：

source: The following examples show how string interpolations are translated into calls to appendInterpolation:
ja: 以下の例は、どのように文字列補間がappendInterpolationへの呼び出しに翻訳されるかを示します：

source: The following examples show the effects of the maxSplits and omittingEmptySubsequences parameters when splitting a string at each space character (” “).
ja: 以下の例は、maxSplitsとomittingEmptySubsequencesパラメータの効果を、各空白文字（” “）で文字列を分割する場合で示します。

source: The following examples show the effects of the maxSplits and omittingEmptySubsequences parameters when splitting a string using a closure that matches spaces.
ja: 以下の例は、maxSplitsとomittingEmptySubsequencesパラメータの効果を、空白にマッチするクロージャを使って文字列を分割する場合で示します。

source: The following examples use this initializer with the contents of two different UInt8 arrays—the first with a well-formed UTF-8 code unit sequence, and the second with an ill-formed sequence at the end.
ja: 以下の例は、このイニシャライザを２つの異なるUInt8配列の内容とともに使います — 整形式UTF-8コード単位シーケンスをもつ最初のもの、そして誤形式シーケンスをその終わりでもつ２番目もの。

source: The function uses a recursive approach to perform the same comparisons on smaller and smaller pieces of the original strings.
ja: この関数は、反復する取り組みを使って、元の文字列のどんどん小さい断片上で同じ比較を実行します。

source: The general category (most usual classification) of the scalar.
ja: このスカラーの一般カテゴリ（最も普通のクラス分け）。

source: The general category of a scalar is its “first-order, most usual categorization”.
ja: あるスカラーの一般カテゴリは、それの “第一次の、最も普通のカテゴリ分け” です。

source: The given argument without any changes.
ja: 何ら変更のない、与えられた引数。

source: The global abs(_:) function provides more familiar syntax when you need to find an absolute value.
ja: グローバルabs(_:)関数は、あなたが絶対値を見つける必要がある時により親しみやすい構文を提供します。

source: The hash value.
ja: ハッシュ値。

source: The hasher to use when combining the components of this instance.
ja: このインスタンスの構成要素を結合する場合に使うハーシャー。

source: The immutable buffer pointer to convert.
ja: 変換されることになる不変のバッファポインタ。

source: The immutable pointer to convert.
ja: 変換されることになる不変ポインタ。

source: The immutable raw pointer to convert.
ja: 変換されることになる不変の生のポインタ。

source: The index at which to start the resulting subsequence.
ja: それで結果の下位シーケンスが始まるインデックス。

source: The index must be a valid index of String(utf16).
ja: このインデックスはString(utf16)の有効なインデックスでなければなりません。

source: The index of the element to access.
ja: アクセスする要素のインデックス。

source: The index of the first byte to swap.
ja: 交換する最初のバイトのインデックス。

source: The index of the first element for which predicate returns true.
ja: それに対してpredicateがtrueを返す最初の要素のインデックス。

source: The index of the first element in a nonempty buffer.
ja: 空でないバッファの中の最初の要素のインデックス。

source: The index of the first element in the reordered collection that matches belongsInSecondPartition.
ja: 並べ直されたコレクションの中の最初の要素のインデックス、それはbelongsInSecondPartitionに合致します。

source: The index of the first value to swap.
ja: 交換する１つ目の値のインデックス。

source: The index of the last element in the collection that matches predicate, or nil if no elements match.
ja: predicateに合致する、コレクションの中の最後の要素のインデックス、または合致する要素がないならばnil。

source: The index of the last element to include in the resulting subsequence.
ja: 結果の下位シーケンスの中に含まれることになる最後の要素のインデックス。

source: The index of the lead surrogate is successfully converted to a position in utf8, but the index of the trailing surrogate is not.
ja: 先頭サロゲートはうまくutf8での位置に変換されます、しかし後続サロゲートのインデックスは違います。

source: The index of the second byte to swap.
ja: 交換する２番目のバイトのインデックス。

source: The index of the second value to swap.
ja: 交換する２つ目の値のインデックス。

source: The index type for a string’s unicodeScalars view.
ja: ある文字列のもつunicodeScalarsビューのためのインデックス型。

source: The index value immediately after i.
ja: iの直後のインデックス。

source: The index value immediately before i.
ja: iの直前のインデックス値。

source: The indices that are valid for subscripting the collection, in ascending order.
ja: コレクションの添え字に使うのに有効である、昇順でのインデックス。

source: The infix operators are grouped below by precedence group in decreasing order of precedence.
ja: 中置演算子は、以下に優先順位の高い方から優先順位グループによって分類されます。

source: The initializer creates the string representation of instance in one of the following ways, depending on its protocol conformance:
ja: イニシャライザは、instanceの文字列表現をそれのプロトコル準拠に依存して以下の方法の１つで作成します：

source: The initializer succeeds if v is a valid Unicode scalar value, in the range 0...0xD7FF or 0xE000...0x10FFFF.
ja: vが有効なユニコードスカラー値、範囲0...0xD7FFまたは0xE000...0x10FFFFの中であるならば、イニシャライザは成功します。

source: The initializer succeeds if v is a valid Unicode scalar value—that is, if v is in the range 0...0xD7FF or 0xE000...0x10FFFF.
ja: vが有効なユニコードスカラー値であるならば — すなわち、vが範囲0...0xD7FFまたは0xE000...0x10FFFFの中であるならば、イニシャライザは成功します。

source: The input was entirely consumed.
ja: 入力はすっかり消費された。

source: The instance can be used to await its completion, cancel the task, etc., The task will run to completion even if there are no other instances of the Task.
ja: そのインスタンスは、それの完了を待機する、タスクを取り消す、などに使われることができます。タスクは、完了まで動作するでしょう、Taskの他のインスタンスが存在しないならば。

source: The instance passed as value will leak if nothing eventually balances the retain.
ja: valueとして渡されるインスタンスは、リテインが結局は均衡を保つことがないならば漏洩します。

source: The instance referenced by this pointer.
ja: このポインタによって参照されるインスタンス。

source: The instance to assign this buffer’s memory to.
ja: インスタンス、それにこのバッファのもつメモリをアサインします。

source: The instance to assign this pointer’s memory to.
ja: インスタンス、それにこのポインタのもつメモリをアサインします。

source: The instance to copy into memory.
ja: メモリにコピーすることになるインスタンス。

source: The instance to initialize this buffer’s memory with.
ja: インスタンス、それでこのバッファのもつメモリ初期化します。

source: The instance to initialize this pointer’s memory with.
ja: インスタンス、それでこのポインタのもつメモリを初期化します。

source: The instance to initialize this pointer’s pointee to.
ja: インスタンス、それにこのポインタのもつpointeeを初期化します。

source: The instances in the region source..<(source + count) are unaffected.
ja: 領域source..<(source + count)の中のインスタンスは、影響を受けません。

source: The joined sequence of elements.
ja: つなぎ合わされたシーケンス要素。

source: The key type to use for the container.
ja: コンテナに対して使うためのキー型。

source: The lanewise maximum of two vectors.
ja: ２つのベクターのレーン単位の最大。

source: The lanewise minimum of two vectors.
ja: ２つのベクターのレーン単位最小。

source: The last element of the collection if the collection has one or more elements; otherwise, nil.
ja: コレクションが１つ以上の要素を持つならばコレクションの最後の要素；そうでなければnil。

source: The last element of the collection if the collection is not empty; otherwise, nil.
ja: コレクションが空でないならばコレクションの最後の要素；そうでなければnil。

source: The last element of the collection.
ja: コレクションの最後の要素。

source: The last element of the sequence that satisfies predicate, or nil if there is no element that satisfies predicate.
ja: predicate満たすシーケンスの最後の要素、またはpredicateを満たす要素が無いならばnil。

source: The last index where element is found.
ja: そこでelementが見つけられた最後のインデックス。

source: The last parameter of these functions is of the associated Stride type—the type that represents the distance between any two instances of the Strideable type.
ja: これらの関数の最後のパラメータは、Stride型 — Strideable型の何らかの２つのインスタンスの間の隔たりを表す型の関連型です。

source: The leading surrogate code unit of x when encoded in UTF-16.
ja: UTF-16でエンコードされる時のxの先行サロゲートペア。

source: The little-endian representation of this integer.
ja: この整数のリトルエンディアン表現。

source: The longer scalar values may need two UInt16 values for storage.
ja: より長いスカラー値は、２つのUInt16値をストレージとして必要とするかもしれません。

source: The lower bound for the range.
ja: 範囲の下側の境界。

source: The lowercase mapping of the scalar.
ja: このスカラーのローワーケースマッピング。

source: The magnitude of this value.
ja: この値の規模。

source: The mask type resulting from pointwise comparisons of this vector type.
ja: このベクター型のポイント単位比較からの結果のマスク型。

source: The masking addition assignment operator (&+=) silently wraps any overflow that occurs during the operation.
ja: マスク加算代入演算子（&+=）は、演算の間に起こるあらゆるオーバーフローを黙ってラップします。

source: The masking multiplication assignment operator (&*=) silently wraps any overflow that occurs during the operation.
ja: マスク乗算代入演算子（&*=）は、演算の間に起こるあらゆるオーバーフローを黙ってラップします。

source: The masking subtraction assignment operator (&-=) silently wraps any overflow that occurs during the operation.
ja: マスク減算代入演算子（&-=）は、演算の間に起こるあらゆるオーバーフローを黙ってラップします。

source: The maximum number of elements to return.
ja: 返される要素の最大限の数。

source: The maximum number of times to split the collection, or one less than the number of subsequences to return.
ja: コレクションを分割する回数の最大限度、または返される下位シーケンスの数より１つ少ないもの。

source: The maximum number of times to split the sequence, or one less than the number of subsequences to return.
ja: シーケンスを分割する回数の最大限度、または返される下位シーケンスの数より１つ少ないもの。

source: The maximum representable integer in this type.
ja: この型における最大の表現可能な整数。

source: The memory at this pointer plus offset must be properly aligned for accessing T and initialized to T or another type that is layout compatible with T.
ja: このポインタにoffsetを加えたところでのメモリは、Tにアクセスするために厳密にアラインされ、そしてTまたはTとレイアウト互換の別の型に初期化されなければなりません。

source: The memory at this pointer plus offset must be properly aligned for accessing T.
ja: offsetを加えたこのポインタでのメモリは、Tにアクセスするために適切にアラインされる必要があります。

source: The memory in the region source..<(source + byteCount) may overlap with the memory referenced by this pointer.
ja: 領域source..<(source + byteCount)の中のメモリは、このポインタによって参照されるメモリと重なるかもしれません。

source: The memory in the region source..<(source + byteCount) must be initialized to a trivial type.
ja: 領域source..<(source + byteCount)の中のメモリは、自明型に初期化されなければなりません。

source: The memory in the region source..<(source + count) may overlap with the destination region.
ja: 領域source..<(source + count)の中のメモリは、行き先の領域と重なるかもしれません。

source: The memory in the region source..<(source + count) must be initialized to type T and must not overlap the destination region.
ja: 領域source..<(source + count)の中のメモリは、型Tに初期化されなければなりません、そして行き先の領域と重なってはいけません。

source: The memory in the region source..<(source + count) must be initialized to type T.
ja: 領域source..<(source + count)の中のメモリは、型Tに初期化されなければなりません。

source: The memory in this region is bound to T, but has not been modified in any other way.
ja: この領域の中のメモリは、Tへと束縛されます、しかし他のいかなる方法においても変更されていません。

source: The memory is allocated, but not initialized.
ja: メモリはアロケートされます、しかし初期化されません。

source: The memory layout of a type, describing its size, stride, and alignment.
ja: ある型のメモリレイアウト、それはそれのサイズ、ストライド、およびアライメントを記述します。

source: The memory must also be uninitialized, initialized to T, or initialized to another trivial type that is layout compatible with T.
ja: メモリはまた、未初期化状態にされる、Tに初期化される、または別の自明型でTとレイアウト互換なものに初期化される必要があります。

source: The memory must be initialized to a value of a type that is layout compatible with type.
ja: メモリは、typeとレイアウト互換である型の値に初期化されなければなりません。

source: The memory must be uninitialized or initialized to a type that is layout compatible with T.
ja: メモリは、未初期化であるかTとレイアウト互換でなければなりません。

source: The memory must not be initialized or Pointee must be a trivial type.
ja: メモリは初期化されてはなりません、またPointeeは自明型でなければなりません。

source: The memory referenced by source may overlap with the memory referenced by this buffer.
ja: sourceによって参照されるメモリは、このバッファによって参照されるメモリと重なるかもしれません。

source: The memory referenced by an UnsafeMutablePointer instance can be in one of several states.
ja: UnsafeMutablePointerインスタンスによって参照されるメモリは、いくつかの状態の１つであることが可能です。

source: The memory referenced by an UnsafeMutableRawPointer instance can be in one of several states.
ja: UnsafeMutableRawPointerインスタンスによって参照されるメモリは、いくつかの状態の１つであることが可能です。

source: The memory referenced by an UnsafePointer instance can be in one of several states.
ja: UnsafePointerインスタンスによって参照されるメモリは、幾つかの状態のうち１つであるはずです。

source: The memory referenced by an UnsafeRawPointer instance can be in one of several states.
ja: UnsafeRawPointerインスタンスによって参照されるメモリは、幾つかの状態のうち１つであるはずです。

source: The memory referenced by the returned raw pointer is still bound to Pointee.
ja: 返される生のポインタによって参照されるメモリは、依然としてPointeeへの境界です。

source: The memory referenced by this buffer must be uninitialized or initialized to a trivial type, and must be properly aligned for accessing T.
ja: このバッファによって参照されるメモリは、未初期化状態にされるまたは自明型に初期化されなければなりません、そしてTにアクセスするために適切にアラインされなければなりません。

source: The memory referenced by this pointer must be initialized.
ja: このポインタによって参照されるメモリは、初期化されなければなりません。

source: The memory referenced by this pointer must be uninitialized or initialized to a trivial type, and must be properly aligned for accessing T.
ja: このポインタによって参照されるメモリは、未初期化状態にされるまたは自明型に初期化されなければなりません、そしてTにアクセスするために適切にアラインされなければなりません。

source: The memory region source..<(source + count) must be initialized.
ja: メモリ領域source..<(source + count)は、初期化されなければなりません。

source: The memory regions referenced by source and this pointer may overlap.
ja: sourceによって参照されるメモリ領域とこのポインタは、重なり合うかもしれません。

source: The memory regions referenced by source and this pointer must not overlap.
ja: sourceによって参照されるメモリ領域とこのポインタは、重なり合わなければなりません。

source: The memory starting at this pointer must be bound to the type T.
ja: このポインタで始まるメモリは、型Tに束縛されていなければなりません。

source: The memory to be deallocated must be uninitialized or initialized to a trivial type.
ja: 割り当て解除されるメモリは、未初期化でなければなりません、または自明型に初期化されなければなりません。

source: The memory to read for the new instance must not extend beyond the buffer pointer’s memory region—that is, offset + MemoryLayout<T>.size must be less than or equal to the buffer pointer’s count.
ja: 新しいインスタンスのために読み出すメモリは、バッファポインタのもつメモリ領域を越えて拡張されてはなりません — すなわち、offset + MemoryLayout<T>.sizeはバッファポインタのもつcountより少ないか等しくなければなりません。

source: The memory written to must not extend beyond the buffer pointer’s memory region—that is, offset + MemoryLayout<T>.size must be less than or equal to the buffer pointer’s count.
ja: 書き込まれることになるメモリは、バッファポインタのもつメモリ領域を越えて拡張されてはなりません — すなわち、offset + MemoryLayout<T>.sizeはバッファポインタのもつcountより少ないか等しくなければなりません。

source: The minimum number of ASCII character’s worth of storage to allocate.
ja: 割り当てる最小数のASCII文字相当のストレージ。

source: The minimum representable integer in this type.
ja: この型における最小の表現可能な整数。

source: The model type on the main actor must use await to call methods on the CoffeeDataStore actor, which allows other work to run on the main thread during the synchronous IO operations.
ja: メインアクター上のmodel型は、awaitを使ってメソッドそれらをCoffeeDataStoreアクター上で呼び出さなければなりません、それは他の作業が同期IO操作の間にメインスレッド上で動作するのを可能にします。

source: The modified sequence ends when the predicate closure returns false.
ja: 修正されたシーケンスは、条件クロージャがfalseを返す時に終わります。

source: The most general classification of a Unicode scalar.
ja: ユニコードスカラーの最も一般的なクラス分け。

source: The multiplication operator (*) calculates the product of its two arguments.
ja: 乗算演算子（*）は、それの２つの引数の積を計算します。

source: The mutable buffer pointer to convert.
ja: 変換されることになる可変のバッファポインタ。

source: The mutable raw pointer to convert.
ja: 変換されることになる可変ポインタ。

source: The name of a scalar is immutable and never changed in future versions of the Unicode Standard.
ja: あるスカラーの名前は不変です、そして決してユニコード標準の将来の版において変更されません。

source: The new Unicode scalar values to add to the string.
ja: 文字列へ加える新しいユニコードスカラー値。

source: The new buffer represents the same region of memory as slice, but is indexed starting at zero instead of sharing indices with the original buffer.
ja: 新しいバッファは、sliceと同じメモリ領域を表します、しかしゼロで開始してインデックスをつけられます、元のバッファとインデックスを共有するのではなく。

source: The new buffer represents the same region of memory as the slice, but its indices start at zero instead of at the beginning of the slice in the original buffer.
ja: 新しいバッファは、このスライスと同じメモリ領域を表します、しかしそれのインデックスはゼロで開始します、元のバッファ中のスライスの始まりでというわけでなく。

source: The new character to insert into the string.
ja: 文字列へ挿入する新しい文字。

source: The new characters to add to the string.
ja: 文字列へ加える新しいいくらかの文字。

source: The new element is inserted before the element currently at the specified index.
ja: 新しい要素は、指定されたインデックスでの現在の要素の前に挿入されます。

source: The new element to insert into the collection.
ja: コレクションに挿入されることになる新しい要素。

source: The new elements are inserted before the element currently at the specified index.
ja: 新しいいくらかの要素が、指定されたインデックスでの現在の要素の前に挿入されます。

source: The new elements to add to the collection.
ja: コレクションに加える新しいいくらかの要素。

source: The new elements to insert into the collection.
ja: コレクションへ挿入される新しいいくらかの要素。

source: The new value represents the address of the pointer passed as pointer.
ja: 新しい値は、pointerとして渡されるポインタのアドレスを表します。

source: The next n bytes of the memory that someBytes references are copied in this code:
ja: someBytesが参照する次のnバイトのメモリは、このコードでコピーされます：

source: The next element in the underlying sequence, if a next element exists; otherwise, nil.
ja: 次の要素が存在するならば、基礎をなすシーケンス中の次の要素；そうでなければ、nil。

source: The next example attempts to convert the indices of the two UTF-16 code points that represent the teacup emoji ("🍵").
ja: 次の例は、ティーカップ絵文字（"🍵"）を表す２つのUTF-16コード点のインデックスの変換を試みます。

source: The next example attempts to retrieve an index six positions from s.startIndex but fails, because that distance is beyond the index passed as limit.
ja: 次の例はs.startIndexから６位置のインデックスをとりだすことを試みます、しかし失敗します、なぜならその間隔はlimitとして渡されるインデックスを越えるからです。

source: The next example attempts to retrieve an index ten positions from numbers.startIndex, but fails, because that distance is beyond the index passed as limit.
ja: 次の例はnumbers.startIndexから10位置のインデックスをとりだすことを試みます、しかし失敗します、なぜならその間隔はlimitとして渡されるインデックスを越えるからです。

source: The next sequential byte in the raw buffer if another byte exists; otherwise, nil.
ja: 別のバイトが存在するならば生のバッファでの次の順次的なバイト；そうでなければ、nil。

source: The normative formal alias of the scalar.
ja: そのスカラーの標準の公式のエイリアス。

source: The number of UTF-8 code units (excluding the null terminator).
ja: UTF-8コード単位の数（null終端子を除外して）。

source: The number of UTF-8 code units worth of memory to allocate for the string (excluding the null terminator).
ja: このUTF-8コード単位の数だけのメモリを文字列に対してアロケートすることになります（null終端子を除外して）。

source: The number of bits equal to 1 in this value’s binary representation.
ja: この値のバイナリ表現の中の１に等しいビットの数。

source: The number of bits in the binary representation of this value.
ja: この値のバイナリ表現でのビット数。

source: The number of bits to shift lhs to the left.
ja: このビット数をlhsから左へとシフトします。

source: The number of bits to shift lhs to the right.
ja: このビット数をlhsから右へとシフトします。

source: The number of bits used for the underlying binary representation of values of this type.
ja: この型の値の基礎をなすバイナリ表現に対して使われるビットの数。

source: The number of bytes in the buffer.
ja: バッファの中のバイト数。

source: The number of bytes in this region is count * MemoryLayout<T>.stride.
ja: この領域の中のバイト数は、count * MemoryLayout<T>.strideです。

source: The number of bytes to allocate.
ja: アロケートすることになるバイト数。

source: The number of bytes to copy.
ja: コピーされることになるバイト数。

source: The number of bytes to include in the buffer.
ja: このバッファの中に含むことになるバイト数。

source: The number of characters in a string.
ja: ある文字列の中の文字数。

source: The number of consecutive copies of newValue to assign.
ja: アサインするnewValueの連続コピーの数。

source: The number of consecutive copies of newValue to initialize.
ja: 初期化するnewValueの連続コピーの数。

source: The number of copies of value to copy into memory.
ja: メモリにコピーすることになるvalueのコピー数。

source: The number of elements contained within this container.
ja: このコンテナ内に含まれる要素の数。

source: The number of elements encoded into the container.
ja: このコンテナへとエンコードされる要素の数。

source: The number of elements in the buffer.
ja: このバッファの中の要素の数。

source: The number of elements in the collection.
ja: コレクションの中の要素の数。

source: The number of elements to drop from the beginning of the collection.
ja: コレクションの始まりから省く要素の数。

source: The number of elements to drop from the beginning of the sequence.
ja: このシーケンスの初めの部分から落とす要素の数。

source: The number of elements to drop off the end of the collection.
ja: コレクションの終わりで省く要素の数。

source: The number of elements to drop off the end of the sequence.
ja: シーケンスの末尾から取り除く要素の数。

source: The number of elements to remove from the collection.
ja: コレクションから削除される要素の数。

source: The number of elements to remove.
ja: 削除する要素の数を返します。

source: The number of instances in the buffer.
ja: バッファの中のインスタンスの数。

source: The number of instances of Pointee to bind to type.
ja: Pointeeのインスタンスの数、typeに束縛されることになります。

source: The number of instances to copy from the memory referenced by source to this pointer’s memory.
ja: sourceによって参照されるメモリからこのポインタのもつメモリまでコピーされるインスタンスの数。

source: The number of instances to deinitialize.
ja: デイニシャライズするインスタンスの数。

source: The number of instances to move from source to this pointer’s memory.
ja: sourceからこのポインタのもつメモリまで移動することになるインスタンスの数。

source: The number of interpolations which will be appended.
ja: 追加されるだろう補間の数。

source: The number of leading zeros in this value’s binary representation.
ja: この値のバイナリ表現における先頭のゼロの数。

source: The number of new elements need not match the number of elements being removed.
ja: 新しい要素の数は、削除される要素の数と一致する必要はありません。

source: The number of scalars, or elements, in a vector of this type.
ja: この型のあるベクターの中のスカラーそれら、または要素それらの数。
